wujunhao910/myir-st-tfa/drivers/st/clk/stm32mp2_clk.c
	CLK_RTC(_CK_RTCCK, RTC_CK, MUX(MUX_RTC), 0, GATE_RTCCK),

	CLK_PLL1(_CK_PLL1, PLL1_CK, MUX(MUX_MUXSEL5), _PLL1, 0),

	CLK_PLL(_CK_PLL2, PLL2_CK, MUX(MUX_MUXSEL6), _PLL2, 0),
	CLK_PLL(_CK_PLL3, PLL3_CK, MUX(MUX_MUXSEL7), _PLL3, 0),
	CLK_PLL(_CK_PLL4, PLL4_CK, MUX(MUX_MUXSEL0), _PLL4, 0),
	CLK_PLL(_CK_PLL5, PLL5_CK, MUX(MUX_MUXSEL1), _PLL5, 0),
	CLK_PLL(_CK_PLL6, PLL6_CK, MUX(MUX_MUXSEL2), _PLL6, 0),
	CLK_PLL(_CK_PLL7, PLL7_CK, MUX(MUX_MUXSEL3), _PLL7, 0),
	CLK_PLL(_CK_PLL8, PLL8_CK, MUX(MUX_MUXSEL4), _PLL8, 0),

	FLEXGEN(_CK_ICN_HS_MCU,	CK_ICN_HS_MCU, CLK_IS_CRITICAL, 0),
	FLEXGEN(_CK_ICN_SDMMC, CK_ICN_SDMMC, CLK_IS_CRITICAL, 1),
	FLEXGEN(_CK_ICN_DDR, CK_ICN_DDR, CLK_IS_CRITICAL, 2),
	FLEXGEN(_CK_ICN_HSL, CK_ICN_HSL, CLK_IS_CRITICAL, 4),
	FLEXGEN(_CK_ICN_NIC, CK_ICN_NIC, CLK_IS_CRITICAL, 5),

	STM32_DIV(_CK_ICN_LS_MCU, CK_ICN_LS_MCU, _CK_ICN_HS_MCU, 0, DIV_LSMCU),

	FLEXGEN(_CK_FLEXGEN_07, CK_FLEXGEN_07, 0, 7),
	FLEXGEN(_CK_FLEXGEN_08, CK_FLEXGEN_08, 0, 8),
	FLEXGEN(_CK_FLEXGEN_09, CK_FLEXGEN_09, 0, 9),
	FLEXGEN(_CK_FLEXGEN_10, CK_FLEXGEN_10, 0, 10),
	FLEXGEN(_CK_FLEXGEN_11, CK_FLEXGEN_11, 0, 11),
	FLEXGEN(_CK_FLEXGEN_12, CK_FLEXGEN_12, 0, 12),
	FLEXGEN(_CK_FLEXGEN_13, CK_FLEXGEN_13, 0, 13),
	FLEXGEN(_CK_FLEXGEN_14, CK_FLEXGEN_14, 0, 14),
	FLEXGEN(_CK_FLEXGEN_15, CK_FLEXGEN_15, 0, 15),
	FLEXGEN(_CK_FLEXGEN_16, CK_FLEXGEN_16, 0, 16),
	FLEXGEN(_CK_FLEXGEN_17, CK_FLEXGEN_17, 0, 17),
	FLEXGEN(_CK_FLEXGEN_18, CK_FLEXGEN_18, 0, 18),
	FLEXGEN(_CK_FLEXGEN_19, CK_FLEXGEN_19, 0, 19),
	FLEXGEN(_CK_FLEXGEN_20, CK_FLEXGEN_20, 0, 20),
	FLEXGEN(_CK_FLEXGEN_21, CK_FLEXGEN_21, 0, 21),
	FLEXGEN(_CK_FLEXGEN_22, CK_FLEXGEN_22, 0, 22),
	FLEXGEN(_CK_FLEXGEN_23, CK_FLEXGEN_23, 0, 23),
	FLEXGEN(_CK_FLEXGEN_24, CK_FLEXGEN_24, 0, 24),
	FLEXGEN(_CK_FLEXGEN_25, CK_FLEXGEN_25, 0, 25),
	FLEXGEN(_CK_FLEXGEN_26, CK_FLEXGEN_26, 0, 26),
	FLEXGEN(_CK_FLEXGEN_27, CK_FLEXGEN_27, 0, 27),
	FLEXGEN(_CK_FLEXGEN_28, CK_FLEXGEN_28, 0, 28),
	FLEXGEN(_CK_FLEXGEN_29, CK_FLEXGEN_29, 0, 29),
	FLEXGEN(_CK_FLEXGEN_30, CK_FLEXGEN_30, 0, 30),
	FLEXGEN(_CK_FLEXGEN_31, CK_FLEXGEN_31, 0, 31),
	FLEXGEN(_CK_FLEXGEN_32, CK_FLEXGEN_32, 0, 32),
	FLEXGEN(_CK_FLEXGEN_33, CK_FLEXGEN_33, 0, 33),
	FLEXGEN(_CK_FLEXGEN_34, CK_FLEXGEN_34, 0, 34),
	FLEXGEN(_CK_FLEXGEN_35, CK_FLEXGEN_35, 0, 35),
	FLEXGEN(_CK_FLEXGEN_36, CK_FLEXGEN_36, 0, 36),
	FLEXGEN(_CK_FLEXGEN_37, CK_FLEXGEN_37, 0, 37),
	FLEXGEN(_CK_FLEXGEN_38, CK_FLEXGEN_38, 0, 38),
	FLEXGEN(_CK_FLEXGEN_39, CK_FLEXGEN_39, 0, 39),
	FLEXGEN(_CK_FLEXGEN_40, CK_FLEXGEN_40, 0, 40),
	FLEXGEN(_CK_FLEXGEN_41, CK_FLEXGEN_41, 0, 41),
	FLEXGEN(_CK_FLEXGEN_42, CK_FLEXGEN_42, 0, 42),
	FLEXGEN(_CK_FLEXGEN_43, CK_FLEXGEN_43, 0, 43),
	FLEXGEN(_CK_FLEXGEN_44, CK_FLEXGEN_44, 0, 44),
	FLEXGEN(_CK_FLEXGEN_45, CK_FLEXGEN_45, 0, 45),
	FLEXGEN(_CK_FLEXGEN_46, CK_FLEXGEN_46, 0, 46),
	FLEXGEN(_CK_FLEXGEN_47, CK_FLEXGEN_47, 0, 47),
	FLEXGEN(_CK_FLEXGEN_48, CK_FLEXGEN_48, 0, 48),
	FLEXGEN(_CK_FLEXGEN_49, CK_FLEXGEN_49, 0, 49),
	FLEXGEN(_CK_FLEXGEN_50, CK_FLEXGEN_50, 0, 50),
	FLEXGEN(_CK_FLEXGEN_51, CK_FLEXGEN_51, 0, 51),
	FLEXGEN(_CK_FLEXGEN_52, CK_FLEXGEN_52, 0, 52),
	FLEXGEN(_CK_FLEXGEN_53, CK_FLEXGEN_53, 0, 53),
	FLEXGEN(_CK_FLEXGEN_54, CK_FLEXGEN_54, 0, 54),
	FLEXGEN(_CK_FLEXGEN_55, CK_FLEXGEN_55, 0, 55),
	FLEXGEN(_CK_FLEXGEN_56, CK_FLEXGEN_56, 0, 56),
	FLEXGEN(_CK_FLEXGEN_57, CK_FLEXGEN_57, 0, 57),
	FLEXGEN(_CK_FLEXGEN_58, CK_FLEXGEN_58, 0, 58),
	FLEXGEN(_CK_FLEXGEN_59, CK_FLEXGEN_59, 0, 59),
	FLEXGEN(_CK_FLEXGEN_60, CK_FLEXGEN_60, 0, 60),
	FLEXGEN(_CK_FLEXGEN_61, CK_FLEXGEN_61, 0, 61),
	FLEXGEN(_CK_FLEXGEN_62, CK_FLEXGEN_62, 0, 62),
	FLEXGEN(_CK_FLEXGEN_63, CK_FLEXGEN_63, 0, 63),

	STM32_DIV(_CK_ICN_APB1, CK_ICN_APB1, _CK_ICN_LS_MCU, 0, DIV_APB1),
	STM32_DIV(_CK_ICN_APB2, CK_ICN_APB2, _CK_ICN_LS_MCU, 0, DIV_APB2),
	STM32_DIV(_CK_ICN_APB3, CK_ICN_APB3, _CK_ICN_LS_MCU, 0, DIV_APB3),
	STM32_DIV(_CK_ICN_APB4, CK_ICN_APB4, _CK_ICN_LS_MCU, 0, DIV_APB4),
	STM32_DIV(_CK_ICN_APBDBG, CK_ICN_APBDBG, _CK_ICN_LS_MCU, 0, DIV_APBDBG),

	/* KERNEL CLOCK */
	GATE(_CK_SYSRAM, CK_BUS_SYSRAM, _CK_ICN_HS_MCU, 0, RCC_SYSRAMCFGR, 1),
	GATE(_CK_RETRAM, CK_BUS_RETRAM, _CK_ICN_HS_MCU, 0, RCC_RETRAMCFGR, 1),
	GATE(_CK_SRAM1, CK_BUS_SRAM1, _CK_ICN_HS_MCU, CLK_IS_CRITICAL, RCC_SRAM1CFGR, 1),
	GATE(_CK_SRAM2, CK_BUS_SRAM2, _CK_ICN_HS_MCU, CLK_IS_CRITICAL, RCC_SRAM2CFGR, 1),

	GATE(_CK_DDRPHYC, CK_BUS_DDRPHYC, _CK_ICN_LS_MCU, 0, RCC_DDRPHYCAPBCFGR, 1),
	GATE(_CK_SYSCPU1, CK_BUS_SYSCPU1, _CK_ICN_LS_MCU, 0, RCC_SYSCPU1CFGR, 1),
	GATE(_CK_CRC, CK_BUS_CRC, _CK_ICN_LS_MCU, 0, RCC_CRCCFGR, 1),
	GATE(_CK_OSPIIOM, CK_BUS_OSPIIOM, _CK_ICN_LS_MCU, 0, RCC_OSPIIOMCFGR, 1),
	GATE(_CK_BKPSRAM, CK_BUS_BKPSRAM, _CK_ICN_LS_MCU, 0, RCC_BKPSRAMCFGR, 1),
	GATE(_CK_HASH, CK_BUS_HASH, _CK_ICN_LS_MCU, 0, RCC_HASHCFGR, 1),
	GATE(_CK_RNG, CK_BUS_RNG, _CK_ICN_LS_MCU, 0, RCC_RNGCFGR, 1),
	GATE(_CK_CRYP1, CK_BUS_CRYP1, _CK_ICN_LS_MCU, 0, RCC_CRYP1CFGR, 1),
	GATE(_CK_CRYP2, CK_BUS_CRYP2, _CK_ICN_LS_MCU, 0, RCC_CRYP2CFGR, 1),
	GATE(_CK_SAES, CK_BUS_SAES, _CK_ICN_LS_MCU, 0, RCC_SAESCFGR, 1),
	GATE(_CK_PKA, CK_BUS_PKA, _CK_ICN_LS_MCU, 0, RCC_PKACFGR, 1),

	GATE(_CK_GPIOA, CK_BUS_GPIOA, _CK_ICN_LS_MCU, 0, RCC_GPIOACFGR, 1),
	GATE(_CK_GPIOB, CK_BUS_GPIOB, _CK_ICN_LS_MCU, 0, RCC_GPIOBCFGR, 1),
	GATE(_CK_GPIOC, CK_BUS_GPIOC, _CK_ICN_LS_MCU, 0, RCC_GPIOCCFGR, 1),
	GATE(_CK_GPIOD, CK_BUS_GPIOD, _CK_ICN_LS_MCU, 0, RCC_GPIODCFGR, 1),
	GATE(_CK_GPIOE, CK_BUS_GPIOE, _CK_ICN_LS_MCU, 0, RCC_GPIOECFGR, 1),
	GATE(_CK_GPIOF, CK_BUS_GPIOF, _CK_ICN_LS_MCU, 0, RCC_GPIOFCFGR, 1),
	GATE(_CK_GPIOG, CK_BUS_GPIOG, _CK_ICN_LS_MCU, 0, RCC_GPIOGCFGR, 1),
	GATE(_CK_GPIOH, CK_BUS_GPIOH, _CK_ICN_LS_MCU, 0, RCC_GPIOHCFGR, 1),
	GATE(_CK_GPIOI, CK_BUS_GPIOI, _CK_ICN_LS_MCU, 0, RCC_GPIOICFGR, 1),
	GATE(_CK_GPIOJ, CK_BUS_GPIOJ, _CK_ICN_LS_MCU, 0, RCC_GPIOJCFGR, 1),
	GATE(_CK_GPIOK, CK_BUS_GPIOK, _CK_ICN_LS_MCU, 0, RCC_GPIOKCFGR, 1),
	GATE(_CK_GPIOZ, CK_BUS_GPIOZ, _CK_ICN_LS_MCU, 0, RCC_GPIOZCFGR, 1),
	GATE(_CK_RTC, CK_BUS_RTC, _CK_ICN_LS_MCU, 0, RCC_RTCCFGR, 1),

	GATE(_CK_DDRCP, CK_BUS_DDR, _CK_ICN_DDR, 0, RCC_DDRCPCFGR, 1),

	/* WARNING 2 CLOCKS FOR ONE GATE */
	GATE(_CK_USB2OHCI, CK_BUS_USB2OHCI, _CK_ICN_HSL, 0, RCC_USB2CFGR, 1),
	GATE(_CK_USB2EHCI, CK_BUS_USB2EHCI, _CK_ICN_HSL, 0, RCC_USB2CFGR, 1),

	GATE(_CK_USB3DR, CK_BUS_USB3DR, _CK_ICN_HSL, 0, RCC_USB3DRCFGR, 1),

	GATE(_CK_BSEC, CK_BUS_BSEC, _CK_ICN_APB3, 0, RCC_BSECCFGR, 1),
	GATE(_CK_IWDG1, CK_BUS_IWDG1, _CK_ICN_APB3, 0, RCC_IWDG1CFGR, 1),
	GATE(_CK_IWDG2, CK_BUS_IWDG2, _CK_ICN_APB3, 0, RCC_IWDG2CFGR, 1),

	GATE(_CK_DDRCAPB, CK_BUS_DDRC, _CK_ICN_APB4, 0, RCC_DDRCAPBCFGR, 1),
	GATE(_CK_DDR, CK_BUS_DDRCFG, _CK_ICN_APB4, 0, RCC_DDRCFGR, 1),

	GATE(_CK_USART2, CK_KER_USART2, _CK_FLEXGEN_08, 0, RCC_USART2CFGR, 1),
	GATE(_CK_UART4, CK_KER_UART4, _CK_FLEXGEN_08, 0, RCC_UART4CFGR, 1),
	GATE(_CK_USART3, CK_KER_USART3, _CK_FLEXGEN_09, 0, RCC_USART3CFGR, 1),
	GATE(_CK_UART5, CK_KER_UART5, _CK_FLEXGEN_09, 0, RCC_UART5CFGR, 1),
	GATE(_CK_I2C1, CK_KER_I2C1, _CK_FLEXGEN_12, 0, RCC_I2C1CFGR, 1),
	GATE(_CK_I2C2, CK_KER_I2C2, _CK_FLEXGEN_12, 0, RCC_I2C2CFGR, 1),
	GATE(_CK_I2C3, CK_KER_I2C3, _CK_FLEXGEN_13, 0, RCC_I2C3CFGR, 1),
	GATE(_CK_I2C5, CK_KER_I2C5, _CK_FLEXGEN_13, 0, RCC_I2C5CFGR, 1),
	GATE(_CK_I2C4, CK_KER_I2C4, _CK_FLEXGEN_14, 0, RCC_I2C4CFGR, 1),
	GATE(_CK_I2C6, CK_KER_I2C6, _CK_FLEXGEN_14, 0, RCC_I2C6CFGR, 1),
	GATE(_CK_I2C7, CK_KER_I2C7, _CK_FLEXGEN_15, 0, RCC_I2C7CFGR, 1),
	GATE(_CK_USART1, CK_KER_USART1, _CK_FLEXGEN_19, 0, RCC_USART1CFGR, 1),
	GATE(_CK_USART6, CK_KER_USART6, _CK_FLEXGEN_20, 0, RCC_USART6CFGR, 1),
	GATE(_CK_UART7, CK_KER_UART7, _CK_FLEXGEN_21, 0, RCC_UART7CFGR, 1),
	GATE(_CK_UART8, CK_KER_UART8, _CK_FLEXGEN_21, 0, RCC_UART8CFGR, 1),
	GATE(_CK_UART9, CK_KER_UART9, _CK_FLEXGEN_22, 0, RCC_UART9CFGR, 1),
	GATE(_CK_STGEN, CK_KER_STGEN, _CK_FLEXGEN_33, 0, RCC_STGENCFGR, 1),
	GATE(_CK_USB3PCIEPHY, CK_KER_USB3PCIEPHY, _CK_FLEXGEN_34, 0, RCC_USB3PCIEPHYCFGR, 1),
	GATE(_CK_USBTC, CK_KER_USBTC, _CK_FLEXGEN_35, 0, RCC_USBTCCFGR, 1),
	GATE(_CK_I2C8, CK_KER_I2C8, _CK_FLEXGEN_38, 0, RCC_I2C8CFGR, 1),
	GATE(_CK_OSPI1, CK_KER_OSPI1, _CK_FLEXGEN_48, 0, RCC_OSPI1CFGR, 1),
	GATE(_CK_OSPI2, CK_KER_OSPI2, _CK_FLEXGEN_49, 0, RCC_OSPI2CFGR, 1),
	GATE(_CK_FMC, CK_KER_FMC, _CK_FLEXGEN_50, 0, RCC_FMCCFGR, 1),
	GATE(_CK_SDMMC1, CK_KER_SDMMC1, _CK_FLEXGEN_51, 0, RCC_SDMMC1CFGR, 1),
	GATE(_CK_SDMMC2, CK_KER_SDMMC2, _CK_FLEXGEN_52, 0, RCC_SDMMC2CFGR, 1),
	GATE(_CK_USB2PHY1, CK_KER_USB2PHY1, _CK_FLEXGEN_57, 0, RCC_USB2PHY1CFGR, 1),
	GATE(_CK_USB2PHY2, CK_KER_USB2PHY2, _CK_FLEXGEN_58, 0, RCC_USB2PHY2CFGR, 1),
};

