wujunhao910/myir-st-tfa/drivers/st/clk/stm32mp2_clk.c
		mmio_clrbits_32(pllxcfgr3, RCC_PLLxCFGR3_FRACIN_MASK);
		mmio_clrbits_32(pllxcfgr4, RCC_PLLxCFGR4_DSMEN);
		mmio_clrbits_32(pllxcfgr3, RCC_PLLxCFGR3_DACEN);
		mmio_setbits_32(pllxcfgr3, RCC_PLLxCFGR3_SSCGDIS);
		mmio_setbits_32(pllxcfgr1, RCC_PLLxCFGR1_SSMODRST);
	} else {
		/* PLL in frac mode */

		/*
		 * No need to check max clock, as oscillator reference clocks
		 * will always be less than 1.2GHz
		 */
		if (refclk < PLL_FRAC_REFCLK_MIN) {
			panic();
		}

		mmio_clrsetbits_32(pllxcfgr3, RCC_PLLxCFGR3_FRACIN_MASK,
				   fracv & RCC_PLLxCFGR3_FRACIN_MASK);
		mmio_setbits_32(pllxcfgr3, RCC_PLLxCFGR3_SSCGDIS);
		mmio_setbits_32(pllxcfgr4, RCC_PLLxCFGR4_DSMEN);
	}

	assert(pllcfg[REFDIV] != 0U);

	mmio_clrsetbits_32(pllxcfgr2, RCC_PLLxCFGR2_FBDIV_MASK,
			   (pllcfg[FBDIV] << RCC_PLLxCFGR2_FBDIV_SHIFT) &
			   RCC_PLLxCFGR2_FBDIV_MASK);
	mmio_clrsetbits_32(pllxcfgr2, RCC_PLLxCFGR2_FREFDIV_MASK,
			   pllcfg[REFDIV] & RCC_PLLxCFGR2_FREFDIV_MASK);
	mmio_clrsetbits_32(pllxcfgr6, RCC_PLLxCFGR6_POSTDIV1_MASK,
			   pllcfg[POSTDIV1] & RCC_PLLxCFGR6_POSTDIV1_MASK);
	mmio_clrsetbits_32(pllxcfgr7, RCC_PLLxCFGR7_POSTDIV2_MASK,
			   pllcfg[POSTDIV2] & RCC_PLLxCFGR7_POSTDIV2_MASK);

	if ((pllcfg[POSTDIV1] == 0U) || (pllcfg[POSTDIV2] == 0U)) {
		/* Bypass mode */
		mmio_setbits_32(pllxcfgr4, RCC_PLLxCFGR4_BYPASS);
		mmio_clrbits_32(pllxcfgr4, RCC_PLLxCFGR4_FOUTPOSTDIVEN);
	} else {
		mmio_clrbits_32(pllxcfgr4, RCC_PLLxCFGR4_BYPASS);
		mmio_setbits_32(pllxcfgr4, RCC_PLLxCFGR4_FOUTPOSTDIVEN);
	}

	return 0;
}

static void clk_stm32_pll_config_csg(struct stm32_clk_priv *priv,
				     const struct stm32_clk_pll *pll,
				     uint32_t *csg)
{
	uintptr_t pllxcfgr1 = priv->base + pll->reg_pllxcfgr1;
	uintptr_t pllxcfgr3 = pllxcfgr1 + RCC_OFFSET_PLLXCFGR3;
	uintptr_t pllxcfgr4 = pllxcfgr1 + RCC_OFFSET_PLLXCFGR4;
	uintptr_t pllxcfgr5 = pllxcfgr1 + RCC_OFFSET_PLLXCFGR5;


	mmio_clrsetbits_32(pllxcfgr5, RCC_PLLxCFGR5_DIVVAL_MASK,
			   csg[DIVVAL] & RCC_PLLxCFGR5_DIVVAL_MASK);
	mmio_clrsetbits_32(pllxcfgr5, RCC_PLLxCFGR5_SPREAD_MASK,
			   (csg[SPREAD] << RCC_PLLxCFGR5_SPREAD_SHIFT) &
			   RCC_PLLxCFGR5_SPREAD_MASK);

	if (csg[DOWNSPREAD] != 0) {
		mmio_setbits_32(pllxcfgr3, RCC_PLLxCFGR3_DOWNSPREAD);
	} else {
		mmio_clrbits_32(pllxcfgr3, RCC_PLLxCFGR3_DOWNSPREAD);
	}

	mmio_clrbits_32(pllxcfgr3, RCC_PLLxCFGR3_SSCGDIS);

	mmio_clrbits_32(pllxcfgr1, RCC_PLLxCFGR1_PLLEN);
	udelay(1);

	mmio_setbits_32(pllxcfgr4, RCC_PLLxCFGR4_DSMEN);
	mmio_setbits_32(pllxcfgr3, RCC_PLLxCFGR3_DACEN);
}

static int stm32_clk_configure_mux(struct stm32_clk_priv *priv, uint32_t data);

static inline struct stm32_pll_dt_cfg *clk_stm32_pll_get_pdata(int pll_idx)
{
	struct stm32_clk_priv *priv = clk_stm32_get_priv();
	struct stm32_clk_platdata *pdata = priv->pdata;

	return  &pdata->pll[pll_idx];
}

static int _clk_stm32_pll1_init(struct stm32_clk_priv *priv, int pll_idx,
				struct stm32_pll_dt_cfg *pll_conf)
{
	const struct stm32_clk_pll *pll = clk_stm32_pll_data(pll_idx);
	unsigned long refclk;
	int ret = 0;

	/*
	 * TODO: check if pll has already good parameters or if we could make
	    a configuration on the fly.
	 */

	stm32mp2_a35_ss_on_hsi();

	ret = stm32_clk_configure_mux(priv, pll_conf->src);
	if (ret != 0) {
		panic();
	}

	refclk = _clk_stm32_get_parent_rate(priv, pll->clk_id);

	/*
	 * No need to check max clock, as oscillator reference clocks will
	 * always be less than 1.2 GHz
	 */
	if (refclk < PLL_REFCLK_MIN) {
		ERROR("%s: %d\n", __func__, __LINE__);
		panic();
	}

	stm32mp2_a35_pll1_config(pll_conf->cfg[FBDIV], pll_conf->cfg[REFDIV],
				 pll_conf->cfg[POSTDIV1], pll_conf->cfg[POSTDIV2]);

	ret = stm32mp2_a35_pll1_start();
	if (ret != 0) {
		panic();
	}

	return 0;
}

static int clk_stm32_pll_wait_mux_ready(struct stm32_clk_priv *priv,
					const struct stm32_clk_pll *pll)
{
	uintptr_t pllxcfgr1 = priv->base + pll->reg_pllxcfgr1;
	uint64_t timeout = timeout_init_us(CLKSRC_TIMEOUT);

	while ((mmio_read_32(pllxcfgr1) & RCC_PLLxCFGR1_CKREFST) !=
	       RCC_PLLxCFGR1_CKREFST) {
		if (timeout_elapsed(timeout)) {
			ERROR("PLL%d ref clock not started\n", pll->clk_id);
			return -ETIMEDOUT;
		}
	}

	return 0;
}

static int _clk_stm32_pll_init(struct stm32_clk_priv *priv, int pll_idx,
			       struct stm32_pll_dt_cfg *pll_conf)
{
	const struct stm32_clk_pll *pll = clk_stm32_pll_data(pll_idx);
	uintptr_t pllxcfgr1 = priv->base + pll->reg_pllxcfgr1;
	bool spread_spectrum = false;
	int ret = 0;

	/*
	 * TODO: check if pll has already good parameters or if we could make
	    a configuration on the fly.
	 */

	_clk_stm32_pll_disable(priv, pll);

	ret = stm32_clk_configure_mux(priv, pll_conf->src);
	if (ret != 0) {
		panic();
	}

	ret = clk_stm32_pll_wait_mux_ready(priv, pll);
	if (ret != 0) {
		panic();
	}

	ret = clk_stm32_pll_config_output(priv, pll, pll_conf->cfg, pll_conf->frac);
	if (ret != 0) {
		panic();
	}

	if (pll_conf->csg_enabled) {
		clk_stm32_pll_config_csg(priv, pll, pll_conf->csg);
		spread_spectrum = true;
	}

	_clk_stm32_pll_enable(priv, pll);

	if (spread_spectrum) {
		mmio_clrbits_32(pllxcfgr1, RCC_PLLxCFGR1_SSMODRST);
	}

	return 0;
}

static int clk_stm32_pll_init(struct stm32_clk_priv *priv, int pll_idx)
{
	struct stm32_pll_dt_cfg *pll_conf = clk_stm32_pll_get_pdata(pll_idx);

	if (pll_conf->enabled) {
		if (pll_idx == _PLL1) {
			return _clk_stm32_pll1_init(priv, pll_idx, pll_conf);
		} else  {
			return _clk_stm32_pll_init(priv, pll_idx, pll_conf);
		}
	}

	return 0;
}

static int stm32mp2_clk_pll_configure(struct stm32_clk_priv *priv)
{
	enum pll_id i;
	int err;

	for (i = _PLL1; i < _PLL_NB; i++) {
		err = clk_stm32_pll_init(priv, i);
		if (err) {
			return err;
		}
	}

	return 0;
}

static int wait_predivsr(uint16_t channel)
{
	struct stm32_clk_priv *priv = clk_stm32_get_priv();
	uintptr_t rcc_base = priv->base;
	uintptr_t previvsr;
	uint32_t channel_bit;
	uint64_t timeout;

	if (channel < __WORD_BIT) {
		previvsr = rcc_base + RCC_PREDIVSR1;
		channel_bit = BIT(channel);
	} else {
		previvsr = rcc_base + RCC_PREDIVSR2;
		channel_bit = BIT(channel - __WORD_BIT);
	}

	timeout = timeout_init_us(CLKDIV_TIMEOUT);
	while ((mmio_read_32(previvsr) & channel_bit) != 0U) {
		if (timeout_elapsed(timeout)) {
			ERROR("Pre divider status: %x\n",
			      mmio_read_32(previvsr));
			return -ETIMEDOUT;
		}
	}

