wujunhao910/myir-st-tfa/drivers/st/clk/stm32mp2_clk.c
	return 0;
}
#endif /* IMAGE_BL2 */

static void stmp32mp2_clk_init_ddr_sub_system(uintptr_t base)
{
	mmio_write_32(base + RCC_DDRCPCFGR,
		      RCC_DDRCPCFGR_DDRCPEN | RCC_DDRCPCFGR_DDRCPLPEN);
}

static struct stm32_osci_dt_cfg mp25_osci[NB_OSCILLATOR];

static struct stm32_pll_dt_cfg mp25_pll[_PLL_NB];

#define DT_FLEXGEN_CLK_MAX	64
static uint32_t mp25_flexgen[DT_FLEXGEN_CLK_MAX];

#define DT_BUS_CLK_MAX		6
static uint32_t mp25_busclk[DT_BUS_CLK_MAX];

#define DT_KERNEL_CLK_MAX	20
static uint32_t mp25_kernelclk[DT_KERNEL_CLK_MAX];

static struct stm32_clk_platdata stm32mp25_pdata = {
	.osci = mp25_osci,
	.nosci = NB_OSCILLATOR,
	.pll = mp25_pll,
	.npll = _PLL_NB,
	.flexgen = mp25_flexgen,
	.nflexgen = DT_FLEXGEN_CLK_MAX,
	.busclk	= mp25_busclk,
	.nbusclk = DT_BUS_CLK_MAX,
	.kernelclk = mp25_kernelclk,
	.nkernelclk = DT_KERNEL_CLK_MAX,
};

static uint8_t refcounts_mp25[CK_LAST];

static struct stm32_clk_priv stm32mp25_clock_data = {
	.base		= RCC_BASE,
	.num		= ARRAY_SIZE(stm32mp25_clk),
	.clks		= stm32mp25_clk,
	.parents	= parent_mp25,
	.nb_parents	= ARRAY_SIZE(parent_mp25),
	.gates		= gates_mp25,
	.nb_gates	= ARRAY_SIZE(gates_mp25),
	.div		= dividers_mp25,
	.nb_div		= ARRAY_SIZE(dividers_mp25),
	.osci_data	= stm32mp25_osc_data,
	.nb_osci_data	= ARRAY_SIZE(stm32mp25_osc_data),
	.gate_refcounts	= refcounts_mp25,
	.pdata		= &stm32mp25_pdata
};

int stm32mp2_clk_init(void)
{
	uintptr_t base = RCC_BASE;
	int ret;

#ifdef IMAGE_BL2
	ret = stm32_clk_parse_fdt(&stm32mp25_pdata);
	if (ret != 0) {
		return ret;
	}
#endif

	ret = clk_stm32_init(&stm32mp25_clock_data, base);
	if (ret != 0) {
		return ret;
	}

	stmp32mp2_clk_init_ddr_sub_system(base);

#ifdef IMAGE_BL2
	ret = stm32mp2_init_clock_tree();
	if (ret != 0) {
		return ret;
	}

	clk_stm32_enable_critical_clocks();
#endif

	return 0;
}

int stm32mp2_pll1_disable(void)
{
#ifdef IMAGE_BL2
	return -EPERM;
#else
	uintptr_t a35_ss_address = A35SSC_BASE;
	uintptr_t pll_enable_reg = a35_ss_address + A35_SS_PLL_ENABLE;

	stm32mp2_a35_ss_on_hsi();

	mmio_clrbits_32(pll_enable_reg, A35_SS_PLL_ENABLE_PD);

	return 0;
#endif
}
